Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionRadial.GetDimensionSet Method (Boolean)
 Gets the dimension set the current dimension belongs to.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override DimensionSetBase GetDimensionSet(
	bool Select
)
Public Overrides Function GetDimensionSet (
	Select As Boolean
) As DimensionSetBase
Parameters
Select
Type: System.Boolean
Whether to select the object from the database or not.
Return Value
Type: DimensionSetBase
The dimension set the current dimension belongs to.
See Also
Reference
CurvedDimensionRadial Class
GetDimensionSet Overload
Tekla.Structures.Drawing Namespace